[
    {
      "title": "If only time could turn around",
      "content": "If only time could turn around,\nI'd keep her close, not let her down.\nBut now she's gone, and here I stand,\nA broken heart, an empty hand."
    },
    {
      "title": "All I Want Is to Be Loved",
      "content": "Oh, to be loved without a plea,\nTo be cherished for simply being me.\nI've given my all, I've stood so tall,\nHelping others, yet feeling small.\n\nThey call me bright, they call me wise,\nBut never see the tears in my eyes.\nA \"thank you\" comes, then they move along,\nNever asking if I'm holding strong.\n\nI lift them up, I guide their way,\nYet alone in the dark, I stay.\nOne mistake, and they turn so cold,\nLaughing, joking, stories told.\n\nAnd then there's her, my heart's soft plea,\nThe one I love, but does she see?\nI offer help, I give my time,\nYet love feels like a hill to climb.\n\nBut if I slip, if I should fall,\nShe turns away, ignores my call.\nDo I deserve to bear this weight,\nTo love so much, yet feel like fate\nHas left me standing all alone,\nA heart unclaimed, a love unknown?\n\nOh, to be loved, just once, just true,\nTo hear the words, \"I see you too.\"\nNot for my mind, not for my grace,\nBut just to feel love’s warm embrace."
    },
    {
      "title": "To You",
      "content": "To the girl whose heart I've broken so,\nCountless times, yet still, my love will grow.\nI don't know how, but each time I fall,\nYet if we tried once more, we'd have it all.\n\nI know you're tired, afraid of the pain,\nWorried I'll hurt you, make you break again.\nBut I swear, I've been trying, giving my best,\nFor in my heart, you’re my endless quest.\n\nForgive me, love, for the times I've failed,\nWith you, my heart is where it’s prevailed."
    },
    {
      "title": "The Best Insult",
      "content": "You left me standing in the storm,\nno warning, no sign, just the eye of the swarm.\nOne of my biggest days turned gray,\nbut I guess you had other things to say.\n\n\"I don't feel safe whenever you're around.\"\nThe best insult I’ve ever found.\nNot loud, not cruel, not even a fight,\njust words that turned off every light.\n\nNot safe? Was I the storm or the sea?\nThe knife or the wound? The lock or the key?\nYou spoke like I was something to fear,\nbut I only ever wanted to keep you near.\n\nBrick by brick, we built this space,\natom by atom, love took its place.\nAnd just like that, you burned it down,\nleft me choking in the ash on the ground.\n\nI don’t know if I should be mad or just break,\nif I should scream or just let myself ache.\nBut I hope one day, when the echoes fade,\nyou realize the safest place was the one you betrayed."
    },
    {
      "title": "Yesterday's Fan",
      "content": "The fan stood still in silent and bare,\nHung in the dark that is unmoved by air.\nI stared at it from midnight's keep,\nThrough hours thick I was too lost for sleep.\n\nA thought crept in, a fleeting thread,\nA whispered rope inside my head.\nBut then I saw it, through heavy haze,\nMy family's love and their warm embrace.\n\nAnd oh, the dawn, so near and so bright,\nA sacred day in hopes of a softer light.\nEid Mubarak, let joy sustain,\nThrough every struggle and every gain."
    },
    {
      "title": "Efforts Turned Waste",
      "content": "I tried and tried, but still, I crave,\nThe love we lost, the life we gave.\nOne mistake, literally just one, was enough\nFor you to leave when times got tough.\n\nWas I a fool or just a tool,\nA name on your list or a heart to fool?\nDid I mean anything at all,\nOr was I only here to crawl?\n\nYou handed me chances as if a taunting pass,\nWaiting for me to slip, to crash.\nWas it love or just a trap,\nA cruel deceit, a perfect wrap?\n\nIf you wanted me, why not confide?\nWhy leave my heart in the dark to hide?\nEvery word and every test you gave,\nMy heart, my soul, yet still, I cave.\n\nYet my answers were never right,\nNot the ones you longed to write.\nIf love was just a guessing game,\nThen tell me, my love, was I to blame?"
    },
    {
      "title": "True Friends",
      "content": "Friends, they say they’re the best,\nbut if you were me you'd second-guess.\nI have many friends with names untold,\nyet only a few shine like gold.\n\nThey're the ones who taught me life,\nstood by me through the darkest nights.\nWhen I was lost, broken and low,\nthey held my hand and refused to let go.\n\nAnd one of them is you, my friend,\na light that guides, a bond that mends.\nWithout you here, without your light,\nI wouldn't have made it through the night."
    },
    {
      "title": "Me and Myself",
      "content": "In the quiet of the day, when nothing calls,\nI hear my thoughts, like whispers in the halls.\nA conversation and the constant stream,\nBetween me and myself is like a quiet dream.\n\nI speak with silence, I talk to the air,\nWondering if I’m truly aware.\nAre these thoughts mine or have they grown,\nA separate voice or a mind of its own?\n\nI’ve wandered this path for countless years,\nChasing my shadow maybe facing my fears.\nIs it madness or merely the art,\nOf living inside my own beating heart?\n\nEach day I ask, \"Am I still sane?\"\nAs words swirl inside my brain.\nYet in the dark I couldn't find any sign,\nJust me with my thoughts, it's lost in time.\n\nSo maybe this chatter is simply a guide,\nA way to not lose what’s deep inside.\nNot madness, but a world unexplored,\nWhere I talk with myself, and never grow bored."
    },
    {
      "title": "The Passenger Seat",
      "content": "The passenger seat, where I sat still,\nNow haunts me, more than any will.\nA truck came in, without a glance,\nAnd crushed my side, erased my chance.\n\nNo time to scream, no time to flee,\nIt aimed for nothing, it landed on me.\nIf it was faster, I’d be gone,\nNo more to break, no right or wrong.\n\nBut I lived on, and that’s the curse,\nEach breath I take, just makes it worse.\nI tried to love, I tried to stay,\nBut only pushed the good away.\n\nNow every time, I take that seat,\nI feel the ghost, beneath my feet.\nA place I should’ve disappeared,\nBut stayed, and broke all I held dear."
    },
    {
      "title": "I Wish It Was Me",
      "content": "I see them walking side by side,\nWhile I just watch alone I hide,\nThey jog together at a quiet pace,\nAnd I remember our brief little chase,\n\nA moment shared a step a glance,\nBut fear stepped in and stole our chance,\nThe lecturer's look is your sudden fear,\nAnd just like that you disappeared,\n\nWe never did those simple things,\nNo group work talks no quiet flings,\nWhenever pairs were made in class,\nI hoped you'd choose me but you let it pass,\n\nAnd if one day you say \"I do\",\nI'll smile but ache in silence too,\nNo matter where or who you see,\nA part of me hoping you'd choose me."
    },
    {
      "title": "Do You Still Remember?",
      "content": "Do you still remember that waterpark day?\nMy voice reached out but you looked away.\nCouples laughed in the warmth of the sun,\nWhile I stood still, I just wanted some fun.\n\nI called your name through splashes and light,\nBut you turned from me, you kept out of sight.\nI watched you laugh with everyone else,\nWhile hurt piled high like books on a shelf.\n\nI wonder now, if I return once more,\nWill memories ache like waves on the shore?\nWill every ride whisper of what we missed,\nOf chances lost in moments dismissed?\n\nThat park still holds the ghosts of our song,\nA place where my wanting felt so wrong.\nDo you still remember, or did you let go?\nYour shadow still lingers where we didn't go."
    },
    {
      "title": "Offering Reassurance",
      "content": "Every time you're down, or full of doubt,\nI tried to help, tried to figure it out.\nWhen you were scared or feeling unsure,\nI gave you love, hoping you'd feel secure.\n\nWhen I was happy or feeling low,\nI still put you first, you might not know.\nI tried so hard to keep us alright,\nBut somehow I lost myself in the fight.\n\nNow I'm the one left picking up the pain,\nWhile you just walked off, no sign of shame.\nYou didn’t see what it did to me,\nOr maybe you did, and let it be.\n\nMaybe I cared too much, too deep,\nNow I lie awake, struggling to sleep.\nI’m sorry I loved with all I could give,\nGuess being myself’s a hard way to live."
    },
    {
      "title": "Simulated Forgetness",
      "content": "He crafts decay with patient hands,\nA caretaker of shifting sands.\nEach loop dissolves, each echo bends,\nAs time forgets the way it ends.\n\nHe paints with silence, fog, and dust,\nA fading waltz, a vinyl's crust.\nWhat once was clear begins to blur,\nA memory that won’t concur.\n\nYet in the noise, we start to feel\nThe things we buried, raw and real.\nThrough simulated mind’s retreat,\nWe find what's lost beneath our feet.\n\nThe more the music slips away,\nThe more our ghosts are asked to stay.\nIn trying to forget it all,\nHe made us pause, and so recall."
    }
  ]
  
